## Production: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.cognito_lambda_kms will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cognito_lambda_kms" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:957818836222:key/632f1017-9281-41b3-8f25-56c6f81843a6",
            ]
        }
    }

  # aws_cloudwatch_log_group.cognito_email_sender will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cognito_email_sender" {
        id                = "/aws/lambda/Cognito_Email_Sender"
        name              = "/aws/lambda/Cognito_Email_Sender"
      ~ retention_in_days = 90 -> 731
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_pre_sign_up will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cognito_pre_sign_up" {
        id                = "/aws/lambda/Cognito_Pre_Sign_Up"
        name              = "/aws/lambda/Cognito_Pre_Sign_Up"
      ~ retention_in_days = 90 -> 731
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                        = "ca-central-1_eSTGTCw33"
        name                      = "forms_user_pool"
        tags                      = {}
      ~ tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ callback_urls                                 = [
          - "https://forms-formulaires.canada.ca/api/auth/callback/cognito",
            # (2 unchanged elements hidden)
        ]
        id                                            = "5rkjd3us3ocssieiitdbtjitiv"
        name                                          = "forms_client"
        # (16 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_lambda_kms will be updated in-place
  ~ resource "aws_iam_policy" "cognito_lambda_kms" {
        id          = "arn:aws:iam::957818836222:policy/cognito_lambda_kms"
        name        = "cognito_lambda_kms"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:957818836222:key/632f1017-9281-41b3-8f25-56c6f81843a6"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags        = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_lambda_logging will be updated in-place
  ~ resource "aws_iam_policy" "cognito_lambda_logging" {
        id          = "arn:aws:iam::957818836222:policy/cognito_lambda_logging"
        name        = "cognito_lambda_logging"
      ~ tags        = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.cognito_userpool_import_logging will be updated in-place
  ~ resource "aws_iam_policy" "cognito_userpool_import_logging" {
        id          = "arn:aws:iam::957818836222:policy/cognito_userpool_import_logging"
        name        = "cognito_userpool_import_logging"
      ~ tags        = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.cognito_lambda will be updated in-place
  ~ resource "aws_iam_role" "cognito_lambda" {
        id                    = "iam_for_cognito_lambda"
        name                  = "iam_for_cognito_lambda"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.cognito_userpool_import will be updated in-place
  ~ resource "aws_iam_role" "cognito_userpool_import" {
        id                    = "role_for_cognito_user_pool_import"
        name                  = "role_for_cognito_user_pool_import"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kms_key.cognito_encryption will be updated in-place
  ~ resource "aws_kms_key" "cognito_encryption" {
        id                                 = "632f1017-9281-41b3-8f25-56c6f81843a6"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
      - filename                       = "/tmp/cognito_email_sender_main.zip" -> null
        id                             = "Cognito_Email_Sender"
      ~ last_modified                  = "2023-10-05T18:39:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6",
        ]
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
      + s3_bucket                      = "placeholder"
      + s3_key                         = "cognito_email_sender_code"
      + s3_object_version              = (known after apply)
      ~ source_code_hash               = "Au9QF/JOavDRQ5VevDLPhwxxPe8omiNw08gEHhHx55Q=" -> "JQU+xOvCFaZHW/kdM3TnHxkFnJXz/ytxiRXLMJzpxF0="
      ~ tags                           = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "NOTIFY_API_KEY" = (sensitive value) -> null
                # (3 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up will be updated in-place
  ~ resource "aws_lambda_function" "cognito_pre_sign_up" {
        id                             = "Cognito_Pre_Sign_Up"
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs will be destroyed
  # (because aws_lambda_layer_version.cognito_email_sender_nodejs is not in configuration)
  - resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      - arn                      = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6" -> null
      - compatible_architectures = [] -> null
      - compatible_runtimes      = [
          - "nodejs16.x",
        ] -> null
      - created_date             = "2023-09-19T18:53:44.051+0000" -> null
      - filename                 = "/tmp/cognito_email_sender_nodejs.zip" -> null
      - id                       = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:6" -> null
      - layer_arn                = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages" -> null
      - layer_name               = "cognito_email_sender_node_packages" -> null
      - skip_destroy             = false -> null
      - source_code_hash         = "qs5cRdZWWVSfafohxew27cuy4hk3mS87FPivY+FhcwQ=" -> null
      - source_code_size         = 14750107 -> null
      - version                  = "6" -> null
    }

  # aws_s3_object.cognito_email_sender_code will be created
  + resource "aws_s3_object" "cognito_email_sender_code" {
      + acl                    = (known after apply)
      + bucket                 = "placeholder"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "cognito_email_sender_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/cognito_email_sender.zip"
      + source_hash            = "JQU+xOvCFaZHW/kdM3TnHxkFnJXz/ytxiRXLMJzpxF0="
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_secretsmanager_secret.cognito_notify_api_key will be destroyed
  # (because aws_secretsmanager_secret.cognito_notify_api_key is not in configuration)
  - resource "aws_secretsmanager_secret" "cognito_notify_api_key" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:cognito_notify_api_key-M0cR8f" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:cognito_notify_api_key-M0cR8f" -> null
      - name                           = "cognito_notify_api_key" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_secretsmanager_secret_version.cognito_notify_api_key will be destroyed
  # (because aws_secretsmanager_secret_version.cognito_notify_api_key is not in configuration)
  - resource "aws_secretsmanager_secret_version" "cognito_notify_api_key" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:cognito_notify_api_key-M0cR8f" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:cognito_notify_api_key-M0cR8f|95DD5E13-0829-49EF-93EF-4B5AA3BA58ED" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:cognito_notify_api_key-M0cR8f" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "95DD5E13-0829-49EF-93EF-4B5AA3BA58ED" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

Plan: 1 to add, 12 to change, 3 to destroy.

Error: Null value found in list

  with data.aws_iam_policy_document.cognito_lambda_secrets,
  on lambda_iam.tf line 89, in data "aws_iam_policy_document" "cognito_lambda_secrets":
  89:     resources = [
  90:       var.notify_api_key_secret_arn
  91:     ]

Null values are not allowed for this attribute value.

Error: Invalid template interpolation value

  on lambda_iam.tf line 118, in data "aws_iam_policy_document" "lambda_s3":
 118:       "${var.lambda_code_arn}/*"
    ├────────────────
    │ var.lambda_code_arn is null

The expression result is null. Cannot include a null value in a string
template.
time=2024-01-22T14:05:37Z level=error msg=terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/cognito/.terragrunt-cache/8rwpy7qGMgyVCvfmfnEUt1oLVxY/-syjFrdAaB-6kNXhMmF1nXBOp7o/cognito prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/cognito] 
time=2024-01-22T14:05:37Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/cognito/.terragrunt-cache/8rwpy7qGMgyVCvfmfnEUt1oLVxY/-syjFrdAaB-6kNXhMmF1nXBOp7o/cognito] exit status 1



```

</details>

